Revit 2027 API
UV.Negate Method
Negates this 2-D vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Negate()
Public Function Negate As UV
public:
UV^ Negate()
member Negate : unit -> UV
Return Value
UV
The 2-D vector opposite to this vector.
Remarks
 The negated vector is obtained by changing the sign of each coordinate of this vector.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace